"[<p class=\"author-section byline-plain\">By <a class=\"author\" href=\"/profile-688/Nick-Allen.html\">Nick Allen For Dailymail.com</a> </p>, <p class=\"byline-section\"><span class=\"article-timestamp article-timestamp-published\"> <span class=\"article-timestamp-label\">Published:</span> <time datetime=\"2024-09-07T18:11:12+0100\"> 13:11 EDT, 7 September 2024 </time> </span> | <span class=\"article-timestamp article-timestamp-updated\"> <span class=\"article-timestamp-label\">Updated:</span> <time datetime=\"2024-09-07T20:00:05+0100\"> 15:00 EDT, 7 September 2024 </time> </span> </p>, <p></p>, <p class=\"count-number\"> 306</p>, <p class=\"count-text\">View <br/> comments</p>, <p></p>, <p class=\"mol-para-with-font\">The <a href=\"/news/royals/index.html\" id=\"mol-75f34c10-64b2-11ef-97ca-bdce2a2ff12d\" style=\"font-weight: bold;\" target=\"_self\">Royal Family</a> may want Prince Harry to remain on a diplomatic visa indefinitely so it does not have to reveal aspects of its finances to the U.S. Government.</p>, <p class=\"mol-para-with-font\">If the <a href=\"/news/prince_harry/index.html\" id=\"mol-f03c4620-64a8-11ef-97ca-bdce2a2ff12d\" style=\"font-weight: bold;\" target=\"_self\">Duke of Sussex</a> was to become a U.S. citizen, or a permanent resident with a green card, it could be a financial 'dagger in the heart' for the royals, one tax expert told Dailymail.com.</p>, <p class=\"mol-para-with-font\">It would mean the Duke having to report his entire worldwide income to America's Internal Revenue Service, including details of any British bank accounts or trusts.</p>, <p class=\"mol-para-with-font\">And documents relating to any joint finances involving the rest of the Royal Family would have to be disclosed.</p>, <p class=\"mol-para-with-font\">It comes amid growing speculation about the Duke's immigration status in the U.S.</p>, <p class=\"mol-para-with-font\">Immigration experts have suggested to Dailymail.com that he may be on an extremely rare A-1 Head of State visa.</p>, <p class=\"imageCaption\">The Duke and Duchess of Sussex dance on a recent tour of Colombia, four years after moving to the U.S.</p>, <p class=\"imageCaption\">The Royal Family could have to disclose financial details if the Duke is tax resident in the U.S., according to experts</p>, <p class=\"mol-para-with-font\">Meanwhile, a court case brought under the Freedom of Information Act, seeking to establish what visa the royal is on, appears to have stalled.</p>, <p class=\"mol-para-with-font\">The case was brought by a Washington D.C.-based think tank, the Heritage Foundation, against the Department of Homeland Security,</p>, <p class=\"mol-para-with-font\">In April, the judge in the case requested records from the Department of Homeland Security, but there has been no public hearing since then.</p>, <p class=\"mol-para-with-font\">It also comes as the Duke is reportedly set to receive a multi-million pound payout in the U.K. on his 40rth birthday later this month from a trust set up by his great-grandmother, the late Queen Mother.</p>, <p class=\"mol-para-with-font\">If he is on a diplomatic visa then he would be taxed, including on that windfall, under the U.K. system.</p>, <p class=\"mol-para-with-font\">He would only be subject to U.S. income tax on his earnings in America, such as his deal with Netflix, which would have to be reported on an IRS Form 1099-NR.</p>, <p class=\"mol-para-with-font\">'The Royal Family wants him to stay on the A-1,' international tax expert Clayton Cartwright told Dailymail.com. 'I think they have common ground wanting him to stay on an A-1. If he's consulted tax advisers then he will be staying on an A-1.</p>, <p class=\"mol-para-with-font\">'The A-1 is his golden ticket. If he's on an A-1 he can sit here (in the U.S.) forever. The U.S. would not care.'</p>, <p class=\"mol-para-with-font\">He added: 'The US has a foreign policy interest in not triggering U.S. tax residency for diplomats. It is good diplomatic practice.</p>, <p class=\"mol-para-with-font\">'It keeps private to Great Britain, not just the foreign assets Prince Harry owns, but also other assets of the Royal Family on which he is listed.'</p>, <p class=\"imageCaption\">The Duke could be on a diplomatic visa but his immigration status is not publicly known</p>, <p class=\"imageCaption\">The Duke and Duchess of Sussex at a gala in New York City</p>, <p class=\"mol-para-with-font\">The Duke is entitled to apply for a green card through his marriage to U.S. citizen Meghan Markle.</p>, <p class=\"mol-para-with-font\">It would make him a permanent resident in the U.S. for tax purposes, and his worldwide income would then be taxed in the U.S. rather than the U.K.</p>, <p class=\"mol-para-with-font\">'In that situation he would have to disclose the interest in the (Queen Mother's) trust (to the IRS). He has to disclose the trust document,' Cartwright said. 'The Royal Family probably doesn't want that to happen.</p>, <p class=\"mol-para-with-font\">'Doubtless they're saying spare him from a green card, that's a tax dagger in the heart of the Royal Family.</p>, <p class=\"mol-para-with-font\">'All that entanglement that probably exists between the Royal Family and his finances would be subject to disclosure. If you said you weren't going to disclose it because its the Royal Family there would be huge blowback.'</p>, <p class=\"mol-para-with-font\">Under America's Report of Foreign Bank and Financial Accounts (FBAR) law the Duke, if he becomes tax resident in the U.S., would also have to disclose any bank accounts in the U.K.</p>, <p class=\"mol-para-with-font\">'Over the last four-and-half years they have probably started to unwind him, some of the financial relationships, such as the Duchy of Cornwall,' Cartwright added. 'But it would take the Royal Family quite a long time to untangle it all. He could be divested from trusts.'</p>, <p class=\"imageCaption\">The Duke and Duchess of Sussex kiss at the trophy presentation at the Sentebale Polo held at the Royal County of Berkshire Polo Club on July 26, 2018 in Windsor, England</p>, <p class=\"mol-para-with-font\">If he is on a diplomatic visa any windfall Harry receives from the Queen Mother's trust on his birthday would be taxed in the U.K.</p>, <p class=\"mol-para-with-font\">The U.S. would 'not care' about it and 'would not have a dog in that fight.'</p>, <p class=\"mol-para-with-font\">If he is on a green card it would count as worldwide income and he would have to pay the tax in the U.S.</p>, <p class=\"mol-para-with-font\">Under a double taxation treaty he would not be taxed in both countries.</p>, <p class=\"mol-para-with-font\">In February, the Duke said he had 'considered' applying to become a U.S. citizen.</p>, <p class=\"mol-para-with-font\">Asked on ABC's Good Morning America what was stopping him, he said: 'I have no idea. It’s a thought that has crossed my mind but it’s not a high priority for me right now.'</p>, <p class=\"mol-para-with-font\">Two months later the Duke indicated that he is 'usually resident' in the U.S.</p>, <p class=\"mol-para-with-font\">The classification was made in a business filing at U.K. Companies House for British-based Travalyst Ltd, which he owns 75 percent of. The company advises travel brands on sustainable tourism.</p>, <p class=\"mol-para-with-font\">In March, Donald Trump suggested he could deport the Duke, telling GB News: 'We’ll have to see if they know something about the drugs, and if he lied they’ll have to take appropriate action.'</p>, <p class=\"imageCaption\">Donald Trump suggested he might deport the Duke if re-elected to the White House</p>, <p class=\"mol-para-with-font\">Another possibility is that the Duke has an O-1 visa, a temporary nonimmigrant visa for foreign nationals with extraordinary ability.</p>, <p class=\"mol-para-with-font\">If so, he would probably meet the 'substantial presence' test - meaning the amount of time he spends in the U.S. would make him resident there for tax purposes.</p>, <p class=\"mol-para-with-font\">In the ongoing Freedom of Information case in Washington D.C. the Heritage Foundation wants to see if, given his admissions of drug use in his autobiography 'Spare', the Duke has been given preferential treatment by the Biden administration.</p>, <p class=\"mol-para-with-font\">When applying for a non-diplomatic U.S. visa foreigners are asked on a form: 'Are you or have you ever been a drug abuser or addict?'</p>, <p class=\"mol-para-with-font\">They are also asked whether they have ever 'violated any law relating to controlled substances'.</p>, <p class=\"mol-para-with-font\">If they answer 'yes' they can still receive a waiver.</p>, <p class=\"mol-para-with-font\">Sources close to the Duke have previously indicated that he answered truthfully on any visa application.</p>, <p class=\"mol-para-with-font\">However, it has not been confirmed which type of visa he applied for.</p>, <p class=\"mol-para-with-font\">London-based US Immigration lawyer Melissa Chavin has previously told Dailymail.com the Duke could have been on an A-1 Head of State visa, which is used by heads of state and royal family members, since he is fifth in line to the throne.</p>, <p class=\"mol-para-with-font\">'It's just extremely special,' she said. 'And the security check is not the same. It's a lower security check. It's a visa especially for members of royal families.'</p>, <p class=\"mol-para-with-font\">Such individuals are only vetted for espionage, terrorism and 'activities contrary to US foreign policy,' rather than drug use.</p>, <p class=\"imageCaption\"></p>, <p class=\"mol-para-with-font\">The A-1 'Head of State' visa is distinguishable from the A-1 visa, which is for senior diplomats.</p>, <p class=\"mol-para-with-font\">Holders of an A-1 visa, such as an ambassador, are supposed to come to the U.S. to work as a senior diplomat.</p>, <p class=\"mol-para-with-font\">But an A-1 Head of State visa holder is free to come to the U.S. without working as a head of state or royal family member.</p>, <p class=\"mol-para-with-font\">At a hearing in Washington D.C. in February, John Bardo, a lawyer for the Department of Homeland Security, told the court: 'He (the Duke) could be on a Category A diplomatic visa. It's possible. We would argue that it's possible.'</p>, <p class=\"mol-para-with-font\">Cartwright, the international taxation expert, said there would be financial downsides for the Duke if he is on a diplomatic visa.</p>, <p class=\"mol-para-with-font\">The Duke would be sacrificing tax breaks he could have as a U.S. citizen.</p>, <p class=\"mol-para-with-font\">He said: 'Prince Harry will not be able to file jointly with his spouse and take advantage of \"married filing jointly\" tax rate brackets.'</p>, <p>Published by Associated Newspapers Ltd</p>, <p>Part of the Daily Mail, The Mail on Sunday &amp; Metro Media Group</p>]"